/****************************************************************************\
所属系统:招生系统
所属模块:订单模块
创建时间:
作   者:
    * Copyright @ Jerrisoft 2018. All rights reserved.
    *┌─────────────────────────────────── ─┐
    *│　此技术信息为本公司机密信息，未经本公司书面同意禁止向第三方披露．       │
    *│　版权所有：杰人软件(深圳)有限公司　　　　　　　　　　　                 │
    *└─────────────────────────────────── ─┘
\***************************************************************************/
namespace AMS.Dto
{
    /// <summary>
    /// 描述：订单分页列表数据
    /// <para>作    者：瞿琦</para>
    /// <para>创建时间：2019-3-6</para>
    /// </summary>
    public interface IOrderListResponse
    {

    }
}
