using AMS.Core;
using Jerrisoft.Platform.Log;
using Jerrisoft.Platform.Storage;


namespace AMS.Storage
{

    /*---------------------------------------------------------------------------------------------------
    * 项目名称 ：$Projectname$
    * 项目描述 ：
    * 类 名 称 ：Class1
    * 类 描 述 ：
    * 所在的域 ：YMM-杰人-技术总
    * 命名空间 ：AMS.Storage
    * 机器名称 ：YMM-杰人-技术总 
    * CLR 版本 ：4.0.30319.42000
    * 作    者 ：user
    * 创建时间 ：2018/7/23 9:49:23 
    * Ver         变更日期                       负责人          变更内容
    * ─────────────────────────────────────────────────
    * V1.0.0.0    2018/7/23 9:49:23       user

    *******************************************************************

    * Copyright @ Jerrisoft 2018. All rights reserved.
    *┌─────────────────────────────────── ─┐
    *│　此技术信息为本公司机密信息，未经本公司书面同意禁止向第三方披露．       │
    *│　版权所有：杰人软件(深圳)有限公司　　　　　　　　　　　                 │
    *└─────────────────────────────────── ─┘

    *******************************************************************
    --------------------------------------------------------------------------------------------------------*/

    /// <summary>
    /// 
    /// </summary>
    /// <remarks>
    /// 调用示例
    /// 
    /// 
    ///
    /// </remarks>

    public class TestRepository : EFRepository
    {
        public void Save()
        {
            LogWriter.Write(this, "异常消息");
        }

        public void GetException()
        {
            throw new BussinessException(5, 1, "测试异常信息");
        }
    }
}
